Autodesk.Revit.DB.PrintSetup.Revert
Revert the current print setting.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current print setting is In-Session.

Autodesk.Revit.DB.PrintSetup.Delete
Delete the current print setting, and make the In-Session setting as the current one.
Returns: False if Delete operation fails, otherwise true.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current print setting is In-Session.

Autodesk.Revit.DB.PrintSetup.Rename(System.String)
Rename the current print setting with the specified name.
newName: print setting name to be renamed as.
Returns: False if Rename operation fails, otherwise true.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the input newName already exists in current print setting list.

Autodesk.Revit.DB.PrintSetup.SaveAs(System.String)
Save the current print setting to another print setting with the specified name.
newName: print setting name to be saved as.
Returns: False if Save As operation fails, otherwise true.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the input newName already exists in current print setting list.

Autodesk.Revit.DB.PrintSetup.Save
Save the changes for the current print setting.
Returns: False if save operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current print setting is In-Session
or the current print setting has not changed.

Autodesk.Revit.DB.PrintSetup.InSession
The in-session Print Setting of Print Setup.

Autodesk.Revit.DB.PrintSetup.CurrentPrintSetting
The current Print Setting of Print Setup.

Autodesk.Revit.DB.PrintSetup
Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
Remarks: The Print Setup object can only get from PrintManager object.